h-1-15deg/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type          atmBoundaryLayerInletVelocity;
        Uref          5;
        Zref          1;
        z0            uniform 0.0024;
	zGround       uniform 0;
	flowDir       (1 0 0);
        value uniform (1 0 0);
	zDir          (0 0 1);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    ground
    {
        type fixedValue;
        value uniform (0 0 0);
    }

    sky
    {
        type slip;
    }

    side_d
    {
        type symmetryPlane;
    }

    side_e
    {
        type symmetryPlane;
    }

    body
    {
        type noSlip;
    }
    
    neighborhood
    {
        type noSlip;
    }
}

// ************************************************************************* //
